"+ Add" = "+ Pridėti";

"Add a card" = "Pridėti kortelę";

"Add a payment method" = "Pridėkite mokėjimo būdą";

"Add bank account" = "Pridėti banko sąskaitą";

"Add new payment method" = "Pridėti naują mokėjimo būdą";

"Add your payment information" = "Pridėkite mokėjimo informaciją";

"Approve payment" = "Patvirtinti mokėjimą";

"Back" = "Atgal";

"Bank account" = "Banko sąskaita";

"Buy now or pay later with Klarna." = "Pirkite dabar arba mokėkite vėliau naudodami \"Klarna\".";

"Buy using a UPI ID" = "Pirkti naudojant UPI ID";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Patvirtindami savo mokėjimą „PayPal“ leidžiate „%@“ nuskaityti mokestį nuo jūsų „PayPal“ sąskaitos vėlesniems mokėjimams pagal jų sąlygas.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Pereidami į „PayPal“ leisite „%@“ nuskaityti mokestį nuo jūsų „PayPal“ sąskaitos vėlesniems mokėjimams pagal taikomas sąlygas.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "Pereidami į „Revolut Pay“ leisite %@ nuskaityti mokestį nuo jūsų „Revolut Pay“ sąskaitos vėlesniems mokėjimams pagal taikomas sąlygas.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Tęsdami sutinkate autorizuoti mokėjimus pagal šias <terms>sąlygas</terms>.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Tęsdami įgaliojate „%1$@“ nurašyti mokestį nuo jūsų „Cash App“ sąskaitos už šį mokėjimą ir būsimuosius mokėjimus pagal „%2$@“ sąlygas, kol šis įgaliojimas bus atšauktas. Galite bet kada tai pakeisti „Cash App“ nuostatose.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Jungdamiesi prie Link sutinkate su <terms>Sąlygomis</terms> ir <privacy>Privatumo politika</privacy>.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Pateikdami mokėjimo duomenis ir patvirtindami šį mokėjimą, leidžiate (A) „%@“ ir „Stripe“ (mūsų mokėjimo paslaugų teikėjui) jūsų bankui siųsti nurodymus nurašyti pinigus iš jūsų sąskaitos ir (B) leidžiate savo bankui, gavus tokius nurodymus, nurašyti pinigus iš jūsų sąskaitos. Pagal jūsų su banku sudarytos sutarties sąlygas turite teisę iš banko reikalauti pinigų grąžinimo. Prašymą grąžinti pinigus turite pateikti per 8 savaites nuo pinigų iš jūsų sąskaitos nurašymo dienos. Jūsų teisės paaiškintos pareiškime, kurį galite gauti iš savo banko. Sutinkate gauti pranešimus apie būsimus nurašymus likus iki 2 dienų iki jų įvykdymo momento.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Išsaugodami savo banko sąskaitą %@, sutinkate autorizuoti mokėjimus pagal šias <terms>sąlygas</terms>.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Atšaukti ir sumokėti kitu būdu";

"Choose a payment method" = "Pasirinkite mokėjimo būdą";

"Close card scanner" = "Išjungti kortelės skaitytuvą";

"Confirm" = "Patvirtinti";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "Patvirtinkite mokėjimą banke ar programėlėje per %@ ir užbaikite pirkimą.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "Patvirtinkite mokėjimą savo banko programėlėje per %@ ir užbaikite pirkimą.";

"Contact information" = "Kontaktinė informacija";

"EPS Bank" = "EPS bankas";

"Enter address manually" = "Įvesti adresą rankiniu būdu";

"FPX Bank" = "FPX bankas";

"IBAN" = "IBAN";

"Manage your payment methods" = "Valdykite savo mokėjimo būdus";

"Name on card" = "Ant kortelės nurodytas vardas ir pavardė";

"Open your UPI app to approve your payment within %@" = "Atidarykite savo UPI programą mokėjimui patvirtinti per %@";

"Or" = "Arba";

"Or pay using" = "Arba mokėti naudojant";

"Or pay with a card" = "Arba mokėti kortele";

"Pay %@" = "Mokėti %@";

"Pay another way" = "Mokėkite kitu būdu";

"Pay faster at %@ and thousands of merchants." = "Mokėkite greičiau „%@“ ir daugybei kitų prekybininkų.";

"Pay in <num_installments/> interest-free payments of <installment_price/> with <img/>" = "Mokėti <num_installments/> be palūkanų <installment_price/> mokėjimus naudojant <img/>";

"Pay later with Klarna." = "Mokėkite vėliau naudodami \"Klarna\".";

"Pay over time with %@" = "Mokėkite vėliau naudodami %@";

"Pay with Link" = "Mokėti naudojant „Link“";

"Pay with your bank account in just a few steps." = "Mokėkite naudodami savo banko sąskaitą vos keliais veiksmais.";

"Payment failed" = "Sumokėti nepavyko";

"Please go back and select another payment method" = "Grįžkite atgal ir pasirinkite kitą mokėjimo būdą";

"Point the camera at your card." = "Nukreipkite fotoaparatą į kortelę.";

"Processing..." = "Apdorojama...";

"Przelewy24 Bank" = "Bankas „Przelewy24“";

"Remove %1$@ ending in %2$@" = "Pašalinti %1$@, kuri baigiasi %2$@";

"Remove Card" = "Šalinti kortelę";

"Save" = "Išsaugoti";

"Save a new payment method" = "Išsaugoti naują mokėjimo būdą";

"Save address" = "išsaugoti adresą";

"Save for future payments" = "Išsaugokite vėlesniems mokėjimams";

"Save my info for secure 1-click checkout" = "Išsaugoti mano informaciją saugiam atsiskaitymui vienu spustelėjimu";

"Save this account for future %@ payments" = "Išsaugoti šią sąskaitą vėlesniems %@ mokėjimams";

"Save this card for future %@ payments" = "Išsaugoti kortelę vėlesniems %@ mokėjimams";

"Save your bank account in just a few steps." = "Vos keliais veiksmais įrašykite savo banko sąskaitą.";

"Select your payment method" = "Pasirinkite mokėjimo būdą";

"Set up" = "Nustatyti";

"Shipping to %@ is not supported." = "Siuntimas į %@ nepalaikomas.";

"Show menu" = "Rodyti meniu";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Per 1–2 darbo dienas „Stripe“ į jūsų sąskaitą įneš 0,01 USD. Tada gausite el. laišką su nurodymais, kaip baigti įrašyti savo banko sąskaitą naudojant „%@“.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Po 1–2 darbo dienas „Stripe“ į jūsų sąskaitą įneš 0,01 USD. Tada gausite el. laišką su nurodymais, kaip užbaigti mokėjimą %@.";

"The IBAN you entered is incomplete." = "Įvedėte ne visą IBAN.";

"Update card" = "Atnaujinti kortelę";

"Your IBAN should start with a two-letter country code." = "Jūsų IBAN turėtų prasidėti šalies kodu iš dviejų raidžių.";

"iDEAL Bank" = "iDEAL bankas";
